Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttributeEnumerator
The ReferenceModelObjectAttributeEnumerator class can be used to enumerate through reference model object attributes.
using Tekla.Structures.Model;
using Tekla.Structures.Model.Collaboration;
using System;
public class Example
{
public void Example1()
{
ReferenceModel RM = new ReferenceModel();
RM.Filename = "c:\\TeklaStructuresModels\\reference_model.dwg";
RM.Scale = 1.0;
if(RM.Insert())
{
foreach(ReferenceModelObject RMO in RM.GetChildren())
{
ReferenceModelObjectAttributeEnumerator RMOAttributeEnumerator = new ReferenceModelObjectAttributeEnumerator(RMO);
while(RMOAttributeEnumerator.MoveNext())
{
ReferenceModelObjectAttribute RMOAttribute = (ReferenceModelObjectAttribute)RMOAttributeEnumerator.Current;
Console.WriteLine("Attribute name: " + RMOAttribute.Name);
}
}
}
}
}

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttributeEnumerator.#ctor(Tekla.Structures.Model.ReferenceModelObject)
Creates a new reference model object attribute enumerator instance.
RMO: The reference model object from which the enumerator is created.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttributeEnumerator.Current
The current attribute.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttributeEnumerator.MoveNext
Moves to the next reference model object attribute.
Returns: True if successfully moved to the next reference model object attribute.

Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttributeEnumerator.Reset
Resets the enumerator.